---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.ShowHeaders
source: html/b720ea6e-5a8d-4b2c-2230-36eb878226fe.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ShowHeaders Property

Indicates if the headers will be displayed in the schedule.

## Syntax (C#)
```csharp
public bool ShowHeaders { get; set; }
```